In [3]:
import pandas as pd

In [5]:
df=pd.read_csv('gdp.csv')

In [7]:
df.head()

  Country Name Country Code  Year         Value
0   Arab World          ARB  1968  2.576068e+10
1   Arab World          ARB  1969  2.843420e+10
2   Arab World          ARB  1970  3.138550e+10
3   Arab World          ARB  1971  3.642691e+10
4   Arab World          ARB  1972  4.331606e+10

In [9]:
df_pr=df[df['Country Name']=='Arab World']

In [35]:
data=df_pr.values

for i in range(1,len(data)):
    prev=data[i-1][3]
    cur=data[i][3]
    print(data[i][2],round(((cur-prev)/prev)*100,2))

1969 10.38
1970 10.38
1971 16.06
1972 18.91
1973 27.02
1974 91.11
1975 10.64
1976 24.51
1977 15.51
1978 9.71
1979 35.46
1980 36.01
1981 3.08
1982 -6.96
1983 -6.28
1984 1.31
1985 -1.31
1986 -4.89
1987 8.18
1988 -1.66
1989 4.82
1990 38.64
1991 -1.59
1992 7.14
1993 1.14
1994 2.31
1995 7.43
1996 10.4
1997 6.06
1998 -3.55
1999 8.85
2000 14.15
2001 -1.6
2002 0.8
2003 12.9
2004 17.1
2005 22.91
2006 18.52
2007 16.63
2008 26.9
2009 -13.58
2010 17.48
2011 18.58
2012 9.58
2013 3.59
2014 2.36
2015 -11.81
2016 -2.29